Revit 2027 API
FamilyManager.IsParameterLocked Method
 For Conceptual Mass and Curtain Panel families, indicate whether the specified dimension-driving parameter is locked.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsParameterLocked(
	FamilyParameter familyParameter
)
Public Function IsParameterLocked (
	familyParameter As FamilyParameter
) As Boolean
public:
bool IsParameterLocked(
	FamilyParameter^ familyParameter
)
member IsParameterLocked :
        familyParameter : FamilyParameter -> bool
Parameters
familyParameter FamilyParameter
Return Value
Boolean
 True if the parameter is lockable and is locked; false otherwise.
Exceptions
Exception | Condition
InvalidOperationException |  Thrown if this family is not a Conceptual Mass or Curtain Panel family.
See Also
Reference
FamilyManager Class
Autodesk.Revit.DB Namespace